{
    "blogPosts": [
        {
            "title": "Coding for the (nearly) First Time",
            "category": "Coding",
            "publishDate": "January 10, 2018",
            "author": "Dan Watson",
            "content": "<article><p>Thank you for visiting my blog! This blog is going to a place for me to document my experiences in the Front End Web Development and UX/UI Designer program at the Nashville Software School. I am taking this course to improve my web development skills with HTML, CSS, and Javascript. This is a new adventure for me that I am excited to embark on.</p><p>Before I get too far in documenting my journey, I'd like to take this opportunity to introduce myself and tell you a little about how I ended up getting into Front End Web Development. I have been an artist and photographer since I was in high school. In college I studied art, photography, design, and communications. After college, I went on teach photography and mathematics at a private co-educational school in New England. After two years of teaching I entered the Master of Fine Arts program at the Savannah College of Art and Design. There, I had my first formal web design training and I built my first website, a portfolio site for my photography. I learned a little HTML and Flash, but built most of the site using Adobe GoLive. I had little control and little understanding of what I was doing, but it worked and I was really excited to finally be live on the web.</p><p>After completing my Master of Fine Arts degree, I once again taught photography at a private school for a couple years and and at the same time I began my photography business. Owning my own business gave me the opportuntity to wear many hats from marketing director to accountant to customer sales rep, and everything in between. I quickly learned that if I wanted to stay in business, I had to take my website seriously and make sure I was presenting the right brand to the world through my site. Throughout my business, I've had many versions of my sites. It has been a great experience in reworking the same concept and improving the site year after year, as my brand and technology evolve. </p><p></p></article>"
        },
        {
            "title": "betterLateThanNever",
            "category": "Coding",
            "publishDate": "January 15, 2018",
            "author": "Dan Watson",
            "content": "After my first couple of weeks of coding the question I keep asking myself is, 'Why didn't start this much, much sooner?' Coding is far more accessible than I ever imagined. Yet, what I like most about it, is that there is so much to learn. The basics are quiet accessible and user friendly, but the depth of complexity and possibility are so incredible that I'm excited to get started and learn more every day.</p>"
        },
        {
            "title": "Hiting a Wall",
            "category": "Coding",
            "publishDate": "January 30, 2018",
            "author": "Dan Watson",
            "content":"Here's some content for another blog post. The more I learn about Javascript, the more excited I am about what I am learning and where I am headed."
        },
        {
            "title": "JSON and Modules",
            "category": "Coding",
            "publishDate": "February 6, 2018",
            "author": "Dan Watson",
            "content": "The last week or so we have been learning about using multiple Javascript pages, i.e. multiple javascript modules along with JSON files."
        },
        {
            "title": "Pit of Despair",
            "category": "Coding",
            "publishDate": "February 15, 2018",
            "author": "Dan Watson",
            "content": "As we continue our work building more complex and functional applications, all of things we've learned to this point are beginning come together."
        },
        {   "title": "Building Cool Stuff",
            "category": "Coding",
            "publishDate": "February 21, 2018",
            "author": "Dan Watson",
            "content": "Now that we have learned incorporate Grunt, Firebase, Bootstrap and other services, we are starting to build some really cool web applications."

        },
        {
            "title": "UX/UI is Critical",
            "category": "Coding",
            "publishDate": "February 28, 2018",
            "author": "Dan Watson",
            "content": ""
        }

    ]
}