[
    {   
        "ID": "first", 
        "title": "My Camera Bags",
        "subtitle": "Independent Capstone Project",
        "projectType": "",
        "brief": "My Camera Bags is an app I created to help photographers organize their photography equipment and see what type of equipment other photographers are using. The mission of My Camera Bags is to organize the life of photographers, help them improve their photography skills, and help them earn a living with their photography equipment. Professional photographers often have several cameras and a significant amount of photography gear overall. Photographers typically don't take all of their gear when going on a shoot. Instead they will take just what they need in order to stay light and organized. Therefore, I thought it would be helpful to give photographers a way to create checklists in order to make sure they have the gear they need for a given shoot. The site was built with HTML5, CSS3, and JavaScript using SASS, Browserify, Flexbox, CSS Grid, Grunt, and Photoshop.",
        "tech":"HTML5, CSS3, JavaScript, SASS, Browserify, Grunt, Git, Bootstrap, CSS Grid, AJAX, jQuery, Firebase, Adobe Photoshop, Adobe Illustrator",
        "github": "https://github.com/danwatson00/my-camera-bag",
        "url": "https://danwatson00.github.io/my-camera-bag/",
        "designBrief": "https://docs.google.com/presentation/d/1uK3Kk6wwlbsaHiWcvdsoObaI_5hK41LWFHQtQmEpSgc/edit?usp=sharing",
        "logo": "/img/my-camera-bags-logo.png",
        "image01": "/img/my_camera_bags_01.jpg",
        "image02": "/img/my_camera_bags_02.jpg",
        "image03": "/img/my_camera_bags_03.jpg",
        "image04": "/img/my_camera_bags_04.jpg",
        "image05": "/img/my_camera_bags_05.jpg"
    },
    {   
        "ID": "second",
        "title": "Boys and Girls Club Survey App",
        "subtitle": "2018 Hack for the Community First Place Project",
        "projectType": "36-hour Hack-a-thon Group Project",
        "brief": "For this project, I was a part of a great team of developers and got to work on a fun and useful product for the Boys and Girls Club of Rutherford County. The project was for the Hack for the Community Event, which is an annual event in Nashville. Our team was honored to take home First Place for the app we made. The Boys and Girls Club wanted an app that could give the children simple, anonymous surveys about how they enjoyed their experiences at the Club. Prior to this event, The Boys and Girls Club only had the ability to give children surveys once per year and they were done on paper, so getting results took a long time as well. Our task was to create a mobile web app that would allow them to administer surveys weekly and get the resultinig data in a timely manner. The child-friendly web app uses simple questions and emoji-style answers to make it quick and easy for kids age 5 to 18. The backend included comprehensive reporting the administrators could access anytime. I was one of two front end developers along with five back end developers, two designers, and QA analyst, and a project manager. I was charged with styling the user interface and helping to make the app functional. It was a great experience working with all of those talented designers and developers.",
        "tech":"HTML5, CSS3, JavaScript, CSS, SASS, Browserify, Grunt, Git, Bootstrap, CSS Grid, AJAX, jQuery, Firebase, Adobe Photoshop, Adobe Illustrator",
        "github": "https://github.com/danwatson00/boys-and-girls-h4tc",
        "url": "https://danwatson00.github.io/boys-and-girls-h4tc/",
        "designBrief": "https://app.zeplin.io/project/5acfa4c0e81dd68145af8f0f",
        "logo": "/img/bgc-logo.png",
        "image01": "/img/bgc-01.jpg", 
        "image02": "/img/bgc-02.jpg",
        "image03": "/img/bgc-03.jpg",
        "image04": "/img/bgc-04.jpg",
        "image05": "/img/bgc-05.jpg"

    },
    {
        "ID": "third",
        "title": "WakeUp Personal Dashboard",
        "subtitle": "React Web App",
        "projectType": "Group Project",
        "brief": "Our group of four was tasked with creating a personal dashboard app in three days. We chose to design the app as mobile first, because the dashboard is meant to be viewed on the go. With the tight deadline, we had to prioritize our MVP (minimum viable product) and done as much as possible. As a part of the group, I was in charge of creating the collapsible containers that would hold the news and weather. I was also responsible for getting the data from the weather api using FETCH. I helped with the Google Authorization via Firebase. It was a great project to work on to learn how to use Reactstrap and FETCH with React. What wasn't completed as a group, I intend to continue on my own, so check back for updates soon.",
        "tech": "React, Reactstrap, JavaScript, HTML5, CSS3, AdobeXD, API Calls",
        "github": "https://github.com/danwatson00/wake-up",
        "url": "https://danwatson00.github.io/wake-up/",
        "designBrief": "https://danwatson00.github.io/wake-up/",
        "logo": "/img/wakeup-logo.png",
        "image01": "/img/wakeup-01.jpg",
        "image02": "/img/wakeup-02.jpg",
        "image03": "/img/wakeup-03.jpg",
        "image04": "/img/wakeup-04.jpg",
        "image05": "/img/wakeup-05.jpg"
    },
    {
        "ID": "fourth",
        "title": "The Photo Blaster",
        "subtitle": "The No Booth Photo Booth",
        "projectType": "Professional Business Branding",
        "brief": "The Photo Blaster is a business I own and created all of the marketing materials for, including printed assets and a SquareSpace website. The Photo Blaster uses modern technology like a touchscreen interface and text messaging through Twilio to allow users to send photos and animated gifs to themselves through the app. The brand design that I created was inspired by the unique booth design. I also designed all of the business cards, promo cards, and website.",
        "tech": "Square Space, CSS, Adobe Photoshop, Adobe Illustrator",
        "github": "",
        "url": "http://thephotoblaster.com",
        "designBrief": "",
        "logo": "/img/photo-blaster-logo.png",
        "image01": "/img/blaster_01.jpg",
        "image02": "/img/blaster_02.jpg",
        "image03": "/img/blaster_03.jpg",
        "image04": "/img/blaster_04.jpg",
        "image05": "/img/blaster_05.jpg"
    },
    {
        "ID": "",
        "title": "Watson Studios",
        "subtitle": "Lifestyle and Commercial Photography",
        "projectType": "Professional Business Branding",
        "brief": "Watson Studios is a business I own and created all of the marketing materials for, including printed assets and a Good Gallery website. Watson Studios provides commercial photography to businesses and lifestyle portraiture to individual clients.",
        "tech": "Good Gallery, CSS, Adobe Photoshop, Adobe InDesign, Adobe Illustrator",
        "github": "",
        "url": "https://www.watson-studios.com",
        "designBrief": "",
        "logo": "",
        "imageHome": "/img/watson-studios-01.jpg",
        "image1": "/img/watson-studios-02.jpg",
        "image2": ""
    },
    {
        "ID": "seventh",
        "title": "World Wide Travel",
        "subtitle": "ReactJS Project",
        "projectType": "Independent Project",
        "brief": "The purpose of this project was to learn the React framework. I learned how to use react components and props, as well as how state works. I'm impressed with how fast and responsive React is. I have also started compiling a library of my own React components and I look forward to putting those to use in the future.",
        "tech": "React, Reactstrap, HTML5, CSS3, JavaScript, Bootstrap, CSS Grid, Adobe Photoshop, Adobe Illustrator",
        "github": "https://github.com/danwatson00/wide-world-travel",
        "url": "",
        "designBrief": "",
        "logo": "img/wide-world-logo.png",
        "image01": "/img/wide-world-travel-01.jpg",
        "image02": "/img/wide-world-travel-02.jpg",
        "image03": "/img/wide-world-travel-03.jpg",
        "image04": "/img/wide-world-travel-04.jpg",
        "image05": "/img/wide-world-travel-05.jpg"
    },
    {
        "ID": "",
        "title": "Number Guessing Game",
        "subtitle": "Javascript Exercise",
        "projectType": "Independent Project",
        "brief": "The purpose of this project was to learn more about JavaScript.",
        "tech": "HTML5, CSS3, JavaScript, Bootstrap",
        "github": "https://github.com/danwatson00/wide-world-travel",
        "url": "",
        "designBrief": "",
        "logo": "img/",
        "imageHome": "img/",
        "image1": "img/",
        "image2": ""
    },
    {
        "ID": "ninth",
        "title": "Crime Checkers",
        "subtitle": "Public Data API and React",
        "projectType": "Group Project",
        "brief": "For our last group project, we were tasked finding a way to use the public data avaialbe from the Nashville public data API. We used the Police Call Log data to provide those interested with almost up to the minute data on calls to Metro Nashville.",
        "tech": "React JS, HTML5, CSS3, JavaScript, Bootstrap, Reactstrap, Google Maps API, Nashville Public Data API",
        "github": "https://github.com/nss-day-cohort-24/uix-crime-checker",
        "url": "",
        "designBrief": "https://docs.google.com/presentation/d/1-ga337wjhJ_ASTBfvLuaSSKqRYGcPd7qDroTPsZB2aU/edit?usp=sharing",
        "logo": "img/crime_checker_logo.png",
        "image01": "/img/crime_checker01.jpg",
        "image02": "/img/crime_checker02.jpg",
        "image03": "/img/crime_checker03.jpg",
        "image04": "/img/crime_checker04.jpg",
        "image05": "/img/crime_checker05.jpg"
    }    
]
